app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY "books"."price" ASC
---
  def index
    @books = Book.order(:price)

SELECT COUNT(*) FROM "books"
---
  def new
    @count = Book.count

INSERT INTO "books" ("title", "author", "price", "published_date", "created_at", "updated_at", "publisher", "pages", "release_date") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @book = Book.new(book_params)
    if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "books" SET "published_date" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["published_date", "2024-01-18 00:00:00"], ["updated_at", "2024-01-25 18:10:28.913083"], ["id", 5]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def delete
    @book = Book.find(params[:id])